app/controllers/v1/orders_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'amar@asdfasd.com' LIMIT 1
SELECT  1 AS one FROM `users` WHERE `users`.`email` = BINARY 'amar@asdfasd.com' AND (`users`.`id` != 1) LIMIT 1
UPDATE `users` SET `phone` = '7845984392', `password_digest` = '$2a$10$LsIJXwvzQNaJCbF3sYTpLeMcaD2FvCpHh2SJiIM9wm/jhluxWuB6K', `updated_at` = '2019-02-17 07:07:09' WHERE `users`.`id` = 1
INSERT INTO `orders` (`uuid`, `total`, `state`, `slot`, `created_at`, `updated_at`, `user_uuid`) VALUES ('adebdad0-137a-0137-a31b-54619d2ffa06', 1, 'requested', '4 - 5 PM', '2019-02-15 18:08:54', '2019-02-15 18:08:54', '94a8b460-137a-0137-a31b-54619d2ffa06')
INSERT INTO `users` (`email`, `password_digest`, `verification_token`, `created_at`, `updated_at`, `uuid`) VALUES ('amar@asdfasd.com', '$2a$10$WjOUOqjdBywhgruLo902sOsucbzbuAko8hLJqWxyq4uuLPU4QreGy', 'gJluyXcJjPDQjr56ZBp3sg', '2019-02-15 18:08:11', '2019-02-15 18:08:11', '94a8b460-137a-0137-a31b-54619d2ffa06')
---
    def create
      current_user =  User.find_or_initialize_by(email: params[:email])
      if current_user.present?
        current_user.first_name = params[:first_name]
        current_user.phone = params[:phone] if params[:phone].present?
        current_user.password = rand(36**20).to_s(36)
        current_user.save
      end
      @order = Order.new(order_params.merge(user_uuid: current_user.uuid))

      if @order.save