app/controllers/listing_attributes_controller.rb

  def index
    @listing_attributes = ListingAttribute.includes(:listing).as_json(methods: :listing_description)
---
SELECT `listing_attributes`.* FROM `listing_attributes`
SELECT `listings`.* FROM `listings` WHERE `listings`.`id` IN (1, 2, 3, 4)