app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `role`, `password_digest`, `verification_token`, `created_at`, `updated_at`, `uuid`) VALUES ('amar@amar.com', 200, '$2a$10$12/a30OvrAC4fbsZO7nELOas9wEwLlCX3hJRgw5e.u7by/K6y37vO', 'jlcu_ji-UNvNpS_zA6WH1A', '2019-02-17 07:21:30', '2019-02-17 07:21:30', '920d2390-14b2-0137-a323-54619d2ffa06')
---
  def register
    @user = User.new(user_params)
    # @user.build_vendor_detail
    if @user.save